14790897/gamepad-xueersi/sdkconfig.defaults
# ESP32 基础配置
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# SPI 外设
CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y

# 分区表
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# 主任务栈大小
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
